Revit 2026 API

# FileImportedEventArgs Class

---

The event arguments used by the FileImported event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPostEventArgs Autodesk.Revit.DB.EventsRevitAPIPostDocEventArgs Autodesk.Revit.DB.EventsFileImportedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FileImportedEventArgs : RevitAPIPostDocEventArgs
```
```vb
Public Class FileImportedEventArgs
	Inherits RevitAPIPostDocEventArgs
```
```cpp
public ref class FileImportedEventArgs : public RevitAPIPostDocEventArgs
```
```fsharp
type FileImportedEventArgs =
    class
        inherit RevitAPIPostDocEventArgs
    end
```

The FileImportedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | Format | Identifies the import format, e.g. DWG or image. |
|  | ImportedInstanceId | The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Path | Path of the source file that was imported. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace